Repository: 6aika/ckanext-archiver
Catalog: ckanext/archiver/i18n/*/LC_MESSAGES/ckanext-archiver.po
Languages: fi

source: Content-length %s exceeds maximum allowed value %s
fi: Sisällön pituus %s ylittää sallitun maksimiarvon %s

source: Server content contained an API error message: %s
fi: Palvelin palautti API virheviestin: %s

source: Content-length after streaming was %i
fi: Sisällön pituus streamauksen jälkeen oli %i

source: No value for ckanext-archiver.cache_url_root in config
fi: Ckanext-archiver.cache_url_root ei ole annettu arvoa konfiguraatiossa

source: URL parsing failure: %s
fi: URL:n jäsentelyvirhe: %s

source: Invalid url scheme. Please use one of: %s
fi: Virheellinen URL-skeema. Käytä jotain seuraavista: %s

source: URL parsing failure - did not find a host name
fi: URL:n jäsentelyvirhe - host namea ei löydetty

source: Connection error: %s
fi: Yhteysvirhe: %s

source: Invalid HTTP response: %s
fi: Virheellinen HTTP -vastaus: %s

source: Connection timed out after %ss
fi: Yhteys aikakatkaistiin %s sekunnin jälkeen

source: Too many redirects
fi: Liian monta uudelleenohjausta (redirects)

source: Error downloading: %s
fi: Virhe ladatessa: %s

source: Error with the download: %s
fi: Virhe latauksessa: %s

source: Invalid URL or Redirect Link
fi: Virheellinen URL tai uudelleenohjauslinkitys

source: Could not make HEAD request
fi: Ei pystytty tekemään HEAD -pyyntöä

source: Error during request: %s
fi: Virhe pyynnön aikana: %s

source: Error with the request: %s
fi: Virhe pyynnössä: %s

source: Server returned HTTP error status: %s %s
fi: Palvelin palautti HTTP virhekoodin: %s%s

source: Link is broken
fi: Linkki on rikki

source: This is a one-off failure
fi: Tämä on kertaluonteinen vika

source: This resource has failed %(failure_count)s times in a row since it first failed: %(first_failure)s
fi: Tämä resurssi on ollut viallinen %(failure_count)skertaa putkeen sen jälkeen kun se ensimmäisen kerran vikaantui %(first_failure)s

source: This resource was last ok: %(last_success)s
fi: Tämä resurssi oli viimeksi kunnossa: %(last_success)s

source: We do not have a past record of it working since the first check: %(created)s
fi: Meillä ei ole tiedossa että resurssi olisi toiminut ensimmäisen tarkistuksen jälkeen: %(created)s

source: Link check is not conclusive
fi: Linkin tarkistus ei ole määrittelevä

source: Link is ok
fi: Linkki on OK

source: Link checked: %(updated)s
fi: Linkki tarkistettu: %(updated)s

source: Download cached copy
fi: Lataa välimuistikopio

source: Size
fi: Koko

source: Cached on
fi: Tallennettu välimuistiin

source: before it was broken
fi: ennen kuin se oli rikki

source: No cached copy available
fi: Välimuistiin tallennettua kopiota ei ole saatavilla

source: Broken datasets
fi: Rikkinäiset datat

source: Broken links
fi: Rikkinäiset linkit

source: % Broken links
fi: % rikkinäisiä linkkejä

source: Index/position of the resource in the dataset
fi: Resurssin järjestysnumero tietoaineistossa

source: Reason
fi: Syy

source: Failed download attempts
fi: Epäonnistuneiden latausyritysten lukumäärä

source: No. of fails
fi: Virhe lkm.

source: First failed attempt
fi: Ensimmäinen epäonnistunut latausyritys

source: First fail
fi: Ensimmäinen virhe

source: Most recent failed attempt
fi: Viimeisin epäonnistunut latausyritys

source: Latest fail
fi: Viimeisin virhe

source: The last time it was successfully obtained
fi: Viimeisin onnistunut latausyritys

source: Last success
fi: Viimeisin onnistunut
